Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.#ctor(Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion)
Initializes a new instance of the Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo class using DTOs.
modelSummaryDTO: Model information as provided from the Cloud DTO
region: Region from cloud model location
Throws System.ArgumentNullException: Cloud information not provided

Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.#ctor(System.String,System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,System.String,System.String,System.String,System.String,System.String,System.String)
Overload to the constructor for creating a model info instance with basic identity properties.
Used for unit testing.
If we have no such overload, unit testing will become impossible due to tight-coupling with the ModelService.
name: Name of the model
modelId: Model unique identifier in the cloud
region: Region where the model is stored in the cloud
versionId: Current model version unique identifier in the cloud
modelSchemaVersion: The model schema version
modelType: The model type
modelOwnerId: The model owner id
modelCreatedBy: User that created the model
modelUpdatedBy: User that last updated the model

Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.ModelId


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.CurrentVersionId
The "current" version associated to the model
Note: It may be changed to the "latest" version in the future.
TBD.

Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.Name


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.ModelSchemaVersion


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.ModelType


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.ModelOwnerId


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.Region


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.ModelTags


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.ModelMetadata


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.ModelCreatedAt


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.ModelCreatedBy


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.ModelUpdatedAt


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.ModelUpdatedBy


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.Equals(System.Object)


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.Equals(Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo)
Determines whether the current instance is equal to another Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo instance.
Remarks: Two instances are considered equal if their Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.Region properties are the
same and their Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.ModelId properties  are equal when compared using a case-insensitive,
culture-invariant comparison.
other: The Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo instance to compare with the current instance, or null.
Returns: true if the specified Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo instance is equal to the current
instance; otherwise, false.

Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.GetHashCode
